[
  {
    "id": "10301111",
    "name": "การเขียนโปรแกรมเบื้องต้น",
    "credit": "3 (2-3-5)",
    "description": "คำอธิบายรายวิชา ศึกษาและปฏิบัติเกี่ยวกับหลักการเขียนโปรแกรม และการวิเคราะห์งานผังงาน รหัสเทียม ขั้นตอนการแก้ไขปัญหา (Algorithms) โครงสร้างภาษาคอมพิวเตอร์ และการใช้กระบวนการเขียนโปรแกรม คำสั่งคำนวณ เงื่อนไข กรณีและการทำซ้ำ การออกแบบและเขียนโปรแกรมอย่างง่ายเพื่อประยุกต์ในงานธุรกิจ",
    "teacher": "ผู้ช่วยศาสตราจารย์ภานุวัฒน์ เมฆะ"
  },
  {
    "id": "10301112",
    "name": "เทคโนโลยีสารสนเทศและการสื่อสาร",
    "credit": "3 (2-3-5)",
    "description": "ระบบสารสนเทศ โปรแกรมสำนักงานพื้นฐาน การทำงานด้านเอกสาร งานด้าน การคำนวณและวิเคราะห์ข้อมูล หลักการสืบค้นรวบรวมและอ้างอิงข้อมูล การป้องกันข้อมูล ในระบบคอมพิวเตอร์ บทบาทสื่อสังคมออนไลน์",
    "teacher": "อาจารย์ ดร.นษิ ตันติธารานุกุล"
  },
  {
    "id": "10100214",
    "name": "เกษตรเพื่อชีวิต",
    "credit": "3 (3-0-6)",
    "description": "วิวัฒนาการ และความสำคัญของการเกษตร ความหลากหลายทางชีวภาพในระบบนิเวศวิทยา ปัจจัยด้านสิ่งแวดล้อมที่มีผลต่อปัจจัยการผลิตทางการเกษตร ระบบการเกษตร ทรัพยากรการผลิตด้านจุลินทรีย์ พืช สัตว์ ประมง: ความหลากหลายของทรัพยากร การนำมาใช้ประโยชน์ การจัดการและการอนุรักษ์ เพื่อการเกษตรที่ยั่งยืน และเป็นมิตรต่อสิ่งแวดล้อม การสื่อสารองค์ความรู้ทางการเกษตร การพัฒนาตามแนวพระราชดำริกับการเกษตร",
    "teacher": "ศาสตราจารย์ ดร.อานัฐ ตันโช"
  },
  {
    "id": "10700301",
    "name": "ภาษาไทยเพื่อการนำเสนอ",
    "credit": "3 (2-2-5)",
    "description": "",
    "teacher": "อาจารย์ ดร.นษิ ตันติธารานุกุล"
  },
  {
    "id": "10305108",
    "name": "แคลคูลัสสำหรับวิทยาศาสตร์และเทคโนโลยี",
    "credit": "3 (2-3-5)",
    "description": "ลิมิตและความต่อเนื่องของฟังก์ชัน อนุพันธ์ของฟังก์ชันและการประยุกต์ อินทิกรัลไม่จำกัดเขตและอินทิกรัลจำกัดเขต สมการเชิงอนุพันธ์สามัญอันดับหนึ่งและการประยุกต์ เมทริกซ์และการหาผลเฉลยของระบบสมการเชิงเส้น",
    "teacher": "อาจารย์ ดร.ธวัชชัย เพชรธาราทิพย์"
  },
  {
    "id": "10301141",
    "name": "เครือข่ายคอมพิวเตอร์เบื้องต้น",
    "credit": "3 (2-3-5)",
    "description": "แนวคิดและทฤษฎีการสื่อสารข้อมูล แบบจำลองโอเอสไอ ทีซีพี/ไอพี ระบบเครือข่ายคอมพิวเตอร์ รูปร่างเครือข่าย อินเทอร์เน็ตโพรโทคอล อุปกรณ์เครือข่าย",
    "teacher": "ผู้ช่วยศาสตราจารย์ ดร.สนิท สิทธิ"
  },
  {
    "id": "10301212",
    "name": "การเขียนโปรแกรมและทักษะการแก้ปัญหา",
    "credit": "3 (2-2-5)",
    "description": "การพัฒนาทักษะในการโปรแกรม การแก้ปัญหาด้วยการโปรแกรมคอมพิวเตอร์ การใช้โครงสร้างข้อมูลและขั้นตอนวิธีเพื่อแก้ปัญหาให้เหมาะสม การใช้งานเครื่องมือสำหรับพัฒนาโปรแกรมภาษาต่าง ๆ ที่เหมาะสม",
    "teacher": "ผู้ช่วยศาสตราจารย์ ดร.พาสน์ ปราโมกข์ชน"
  },
  {
    "id": "10301113",
    "name": "คณิตศาสตร์ดีสครีต",
    "credit": "3 (3-0-6)",
    "description": "ทฤษฎีเซต ตรรกศาสตร์ ความสัมพันธ์และฟังก์ชัน การนับ การเรียงสับเปลี่ยนและการจัดกลุ่ม ความสัมพันธ์เวียนเกิด ต้นไม้และการเรียงลำดับ กราฟและการประยุกต์ใช้ อัลกอริทึมข่ายงาน พีชคณิตบูลีน ออโตเมตา",
    "teacher": "อาจารย์ ดร.นษิ ตันติธารานุกุล"
  },
  {
    "id": "10700309",
    "name": "สนทนาภาษาอังกฤษ",
    "credit": "3 (2-2-5)",
    "description": "พัฒนาความสามารถในการพูดภาษาอังกฤษและสื่อสารในชีวิตประจำวัน โดยครอบคลุมถึงภาษาอังกฤษในการทำงาน และฝึกการออกเสียงที่ถูกต้อง",
    "teacher": "อาจารย์ณัฐชยา ตั้งตระกูล"
  },
  
 
  {
    "id": "10301221",
    "name": "การวิเคราะห์และออกแบบเชิงวัตถุ",
    "credit": "3 (2-3-5)",
    "description": " บทบาทและคุณสมบัติของนักวิเคราะห์ระบบ ความต้องการของระบบ คุณสมบัติของระบบ พื้นฐานการวิเคราะห์และออกแบบระบบเชิงโครงสร้าง หลักการพื้นฐานเชิงวัตถุ การวิเคราะห์เชิงวัตถุ",
    "teacher": "ผู้ช่วยศาสตราจารย์ก่องกาญจน์ ดุลยไชย"
  },
 
 
  {
    "id": "10301233",
    "name": "การพัฒนาซอฟต์แวร์บนอุปกรณ์เคลื่อนที่",
    "credit": "3 (2-3-5)",
    "description": "การติดต่อกับผู้ใช้ผ่านแอพลิเคชั่นบนอุปกรณ์เคลื่อนที่ การให้บริการ และการจัดเก็บ หรือการดึงข้อมูล เซ็นเซอร์ต่างๆ ซึ่งสนับสนุนในส่วนของแอพลิเคชั่นบนอุปกรณ์เคลื่อนที่ โครงสร้าง เปรียบเทียบความเหมือน",
    "teacher": "ผู้ช่วยศาสตราจารย์ ดร.ปวีณ เขื่อนแก้ว"
  }
]